In [2]:
import numpy as np
import pandas as pd
import json
from pandas.io.json import json_normalize

In [55]:
json_string = json.load((open('data/world_bank_projects.json')))
json_normal = json_normalize(json_string, 'mjtheme_namecode')
print(json_normal.shape)
print(json_normal.info())
print(json_normal.head())

(1499, 2)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1499 entries, 0 to 1498
Data columns (total 2 columns):
code    1499 non-null object
name    1499 non-null object
dtypes: object(2)
memory usage: 23.5+ KB
None
  code                                   name
0    8                      Human development
1   11
2    1                    Economic management
3    6  Social protection and risk management
4    5                  Trade and integration

In [62]:
json_no_nulls = json_normal[json_normal['name'] != '']
print(json_no_nulls.shape)

json_no_nulls.groupby('name')['code'].agg('count').sort_values(ascending=False).head(10)

(1377, 2)

name
Environment and natural resources management    223
Rural development                               202
Human development                               197
Public sector governance                        184
Social protection and risk management           158
Financial and private sector development        130
Social dev/gender/inclusion                     119
Trade and integration                            72
Urban development                                47
Economic management                              33
Name: code, dtype: int64

In [63]:
json_normal = json_normal.sort_values(['code', 'name'], ascending=True)
json_normal.head(10)

     code                 name
212     1
363     1
1024    1
1114    1
1437    1
2       1  Economic management
88      1  Economic management
175     1  Economic management
204     1  Economic management
205     1  Economic management

In [64]:
json_normal['name'][json_normal['name'] == ''] = np.nan
json_normal.head(10)

     code                 name
212     1                  NaN
363     1                  NaN
1024    1                  NaN
1114    1                  NaN
1437    1                  NaN
2       1  Economic management
88      1  Economic management
175     1  Economic management
204     1  Economic management
205     1  Economic management